Documents/ПриходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПриходДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1Дт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1Кт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2Дт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2Кт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3Дт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3Кт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ВидОперацииНаСервере()
	
	СтруктураСчетов = БухгалтерскийУчетСервер.ПолучитьСчетаПоВидуОперации(Объект.ВидОперации);
	Объект.СчетДт = СтруктураСчетов.СчетДт; 
	Объект.СчетКт = СтруктураСчетов.СчетКт;
	
	СчетПриИзмененииСервер("Дт");
	СчетПриИзмененииСервер("Кт");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНаКлиенте()
	
	СчетПриИзмененииСервер("Дт");
	СчетПриИзмененииСервер("Кт");
	
	Элементы.СчетДт.Доступность = НЕ ЗначениеЗаполнено(Объект.СчетДт);
	Элементы.СчетКт.Доступность = НЕ ЗначениеЗаполнено(Объект.СчетКт);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
Процедура СчетПриИзмененииСервер(ВидСчета)
	
	ЗаголовкиСубконто = Новый Структура;
	ЗаголовкиСубконто.Вставить("Субконто1", Ложь);
	ЗаголовкиСубконто.Вставить("Субконто2", Ложь);
	ЗаголовкиСубконто.Вставить("Субконто3", Ложь);
	
	Субконто = Объект["Счет" + ВидСчета].ВидыСубконто;
	
	Для Каждого Стр Из Субконто Цикл
		ИмяСубконто = "Субконто" + Стр.НомерСтроки + ВидСчета;
		Объект[ИмяСубконто] = Стр.ВидСубконто.ТипЗначения.ПривестиЗначение(Объект[ИмяСубконто]);
		Элементы[ИмяСубконто].Заголовок = Стр.ВидСубконто.Наименование;
		ЗаголовкиСубконто["Субконто" + Стр.НомерСтроки] = Истина;
	КонецЦикла;
	
	Элементы["Субконто1" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто1"];
	Элементы["Субконто2" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто2"];
	Элементы["Субконто3" + ВидСчета].Видимость = ЗаголовкиСубконто["Субконто3"];
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ВидОперацииПриИзменении();
	Иначе
		ВидОперацииНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент = Неопределено)
	
	ВидОперацииНаСервере();
	
	Элементы.СчетДт.Доступность = НЕ ЗначениеЗаполнено(Объект.СчетДт);
	Элементы.СчетКт.Доступность = НЕ ЗначениеЗаполнено(Объект.СчетКт);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	
	СчетПриИзмененииСервер("Дт");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)
	
	СчетПриИзмененииСервер("Кт");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
